# CannotPasteOrphanTags Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..CannotPasteOrphanTags Property
BuiltInFailures..::..TagFailures Class See Also
---
Orphaned tags cannot be pasted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteOrphanTags { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteOrphanTags As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteOrphanTags {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace